{
  "_name_or_path": "answerdotai/ModernBERT-base",
  "architectures": [
"ModernBertForTokenClassificationCRF"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 50281,
  "classifier_activation": "gelu",
  "classifier_bias": false,
  "classifier_dropout": 0.0,
  "classifier_pooling": "mean",
  "cls_token_id": 50281,
  "decoder_bias": true,
  "deterministic_flash_attn": false,
  "embedding_dropout": 0.0,
  "eos_token_id": 50282,
  "global_attn_every_n_layers": 3,
  "global_rope_theta": 160000.0,
  "gradient_checkpointing": false,
  "hidden_activation": "gelu",
  "hidden_size": 768,
  "id2label": {
    "0": "B-CARDINAL",
    "1": "B-DATE",
    "2": "B-EVENT",
    "3": "B-FAC",
    "4": "B-GPE",
    "5": "B-LANGUAGE",
    "6": "B-LAW",
    "7": "B-LOC",
    "8": "B-MONEY",
    "9": "B-NORP",
    "10": "B-ORDINAL",
    "11": "B-ORG",
    "12": "B-PERCENT",
    "13": "B-PERSON",
    "14": "B-PRODUCT",
    "15": "B-QUANTITY",
    "16": "B-TIME",
    "17": "B-WORK_OF_ART",
    "18": "I-CARDINAL",
    "19": "I-DATE",
    "20": "I-EVENT",
    "21": "I-FAC",
    "22": "I-GPE",
    "23": "I-LANGUAGE",
    "24": "I-LAW",
    "25": "I-LOC",
    "26": "I-MONEY",
    "27": "I-NORP",
    "28": "I-ORDINAL",
    "29": "I-ORG",
    "30": "I-PERCENT",
    "31": "I-PERSON",
    "32": "I-PRODUCT",
    "33": "I-QUANTITY",
    "34": "I-TIME",
    "35": "I-WORK_OF_ART",
    "36": "O"
  },
  "initializer_cutoff_factor": 2.0,
  "initializer_range": 0.02,
  "intermediate_size": 1152,
  "label2id": {
    "B-CARDINAL": 0,
    "B-DATE": 1,
    "B-EVENT": 2,
    "B-FAC": 3,
    "B-GPE": 4,
    "B-LANGUAGE": 5,
    "B-LAW": 6,
    "B-LOC": 7,
    "B-MONEY": 8,
    "B-NORP": 9,
    "B-ORDINAL": 10,
    "B-ORG": 11,
    "B-PERCENT": 12,
    "B-PERSON": 13,
    "B-PRODUCT": 14,
    "B-QUANTITY": 15,
    "B-TIME": 16,
    "B-WORK_OF_ART": 17,
    "I-CARDINAL": 18,
    "I-DATE": 19,
    "I-EVENT": 20,
    "I-FAC": 21,
    "I-GPE": 22,
    "I-LANGUAGE": 23,
    "I-LAW": 24,
    "I-LOC": 25,
    "I-MONEY": 26,
    "I-NORP": 27,
    "I-ORDINAL": 28,
    "I-ORG": 29,
    "I-PERCENT": 30,
    "I-PERSON": 31,
    "I-PRODUCT": 32,
    "I-QUANTITY": 33,
    "I-TIME": 34,
    "I-WORK_OF_ART": 35,
    "O": 36
  },
  "layer_norm_eps": 1e-05,
  "local_attention": 128,
  "local_rope_theta": 10000.0,
  "max_position_embeddings": 8192,
  "mlp_bias": false,
  "mlp_dropout": 0.0,
  "model_type": "modernbert",
  "norm_bias": false,
  "norm_eps": 1e-05,
  "num_attention_heads": 12,
  "num_hidden_layers": 22,
  "pad_token_id": 50283,
  "position_embedding_type": "absolute",
  "reference_compile": null,
  "sep_token_id": 50282,
  "sparse_pred_ignore_index": -100,
  "sparse_prediction": false,
  "torch_dtype": "float32",
  "transformers_version": "4.48.0.dev0",
  "vocab_size": 50368
}
